Revit 2027 API
BuiltInFailures.SweepFailures.ProfileLoopEmpty Property
 Profile sketch is empty!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProfileLoopEmpty { get; }
Public Shared ReadOnly Property ProfileLoopEmpty As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProfileLoopEmpty {
	FailureDefinitionId^ get ();
}
static member ProfileLoopEmpty : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SweepFailures Class
Autodesk.Revit.DB Namespace